lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]

for n in lst:
    if n % 3 == 0 and n < 30:
        print(n)

# Вывести элементы, которые меньше 30
# Делятся на 3 без остатка
